; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-18)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city5)
	(fuel-level plane1 fl1)
	(at plane2 city3)
	(fuel-level plane2 fl2)
	(at plane3 city1)
	(fuel-level plane3 fl3)
	(at person1 city1)
	(at person2 city4)
	(at person3 city6)
	(at person4 city1)
	(at person5 city1)
	(at person6 city6)
	(at person7 city4)
	(at person8 city0)
	(at person9 city5)
	(at person10 city0)
	(at person11 city4)
	(at person12 city1)
	(at person13 city0)
	(at person14 city2)
	(at person15 city2)
	(at person16 city0)
	(at person17 city3)
	(at person18 city0)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane2 city1)
	(at person1 city3)
	(at person2 city0)
	(at person3 city5)
	(at person4 city7)
	(at person5 city0)
	(at person6 city1)
	(at person7 city1)
	(at person8 city4)
	(at person9 city5)
	(at person10 city4)
	(at person11 city6)
	(at person12 city2)
	(at person13 city0)
	(at person14 city2)
	(at person15 city4)
	(at person16 city3)
	(at person17 city7)
	(at person18 city0)
	))

)

; plan
1. (board person5 plane3 city1)
   deleted: (at person5 city1)
   added: (in person5 plane3)
   goals met: 4 of 19
2. (zoom plane3 city1 city0 fl3 fl2 fl1)
   deleted: (at plane3 city1) (fuel-level plane3 fl3)
   added: (at plane3 city0) (fuel-level plane3 fl1)
   goals met: 4 of 19
3. (board person8 plane3 city0)
   deleted: (at person8 city0)
   added: (in person8 plane3)
   goals met: 4 of 19
4. (debark person5 plane3 city0)
   deleted: (in person5 plane3)
   added: (at person5 city0)
   goals met: 5 of 19
5. (board person16 plane3 city0)
   deleted: (at person16 city0)
   added: (in person16 plane3)
   goals met: 5 of 19
6. (board person10 plane3 city0)
   deleted: (at person10 city0)
   added: (in person10 plane3)
   goals met: 5 of 19
7. (fly plane3 city0 city4 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 5 of 19
8. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 5 of 19
9. (debark person8 plane3 city4)
   deleted: (in person8 plane3)
   added: (at person8 city4)
   goals met: 6 of 19
10. (board person7 plane3 city4)
   deleted: (at person7 city4)
   added: (in person7 plane3)
   goals met: 6 of 19
11. (board person2 plane3 city4)
   deleted: (at person2 city4)
   added: (in person2 plane3)
   goals met: 6 of 19
12. (board person11 plane3 city4)
   deleted: (at person11 city4)
   added: (in person11 plane3)
   goals met: 6 of 19
13. (debark person10 plane3 city4)
   deleted: (in person10 plane3)
   added: (at person10 city4)
   goals met: 7 of 19
14. (board person17 plane2 city3)
   deleted: (at person17 city3)
   added: (in person17 plane2)
   goals met: 7 of 19
15. (zoom plane2 city3 city1 fl2 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl2)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 8 of 19
16. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 19
17. (board person4 plane2 city1)
   deleted: (at person4 city1)
   added: (in person4 plane2)
   goals met: 8 of 19
18. (board person12 plane2 city1)
   deleted: (at person12 city1)
   added: (in person12 plane2)
   goals met: 8 of 19
19. (board person1 plane2 city1)
   deleted: (at person1 city1)
   added: (in person1 plane2)
   goals met: 8 of 19
20. (fly plane1 city5 city2 fl1 fl0)
   deleted: (at plane1 city5) (fuel-level plane1 fl1)
   added: (at plane1 city2) (fuel-level plane1 fl0)
   goals met: 8 of 19
21. (board person15 plane1 city2)
   deleted: (at person15 city2)
   added: (in person15 plane1)
   goals met: 8 of 19
22. (refuel plane1 city2 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 8 of 19
23. (fly plane1 city2 city4 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 8 of 19
24. (debark person15 plane1 city4)
   deleted: (in person15 plane1)
   added: (at person15 city4)
   goals met: 9 of 19
25. (fly plane3 city4 city0 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 9 of 19
26. (refuel plane3 city0 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 9 of 19
27. (debark person2 plane3 city0)
   deleted: (in person2 plane3)
   added: (at person2 city0)
   goals met: 10 of 19
28. (fly plane3 city0 city1 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 10 of 19
29. (refuel plane3 city1 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 10 of 19
30. (debark person7 plane3 city1)
   deleted: (in person7 plane3)
   added: (at person7 city1)
   goals met: 11 of 19
31. (fly plane3 city1 city3 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 11 of 19
32. (refuel plane3 city3 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 11 of 19
33. (debark person16 plane3 city3)
   deleted: (in person16 plane3)
   added: (at person16 city3)
   goals met: 12 of 19
34. (fly plane3 city3 city6 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl1)
   added: (at plane3 city6) (fuel-level plane3 fl0)
   goals met: 12 of 19
35. (board person6 plane3 city6)
   deleted: (at person6 city6)
   added: (in person6 plane3)
   goals met: 12 of 19
36. (refuel plane3 city6 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 12 of 19
37. (board person3 plane3 city6)
   deleted: (at person3 city6)
   added: (in person3 plane3)
   goals met: 12 of 19
38. (debark person11 plane3 city6)
   deleted: (in person11 plane3)
   added: (at person11 city6)
   goals met: 13 of 19
39. (fly plane3 city6 city1 fl1 fl0)
   deleted: (at plane3 city6) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 13 of 19
40. (refuel plane3 city1 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 13 of 19
41. (debark person6 plane3 city1)
   deleted: (in person6 plane3)
   added: (at person6 city1)
   goals met: 14 of 19
42. (fly plane3 city1 city5 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city5) (fuel-level plane3 fl0)
   goals met: 14 of 19
43. (debark person3 plane3 city5)
   deleted: (in person3 plane3)
   added: (at person3 city5)
   goals met: 15 of 19
44. (fly plane2 city1 city7 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city7) (fuel-level plane2 fl0)
   goals met: 14 of 19
45. (refuel plane2 city7 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 14 of 19
46. (debark person4 plane2 city7)
   deleted: (in person4 plane2)
   added: (at person4 city7)
   goals met: 15 of 19
47. (debark person17 plane2 city7)
   deleted: (in person17 plane2)
   added: (at person17 city7)
   goals met: 16 of 19
48. (fly plane2 city7 city2 fl1 fl0)
   deleted: (at plane2 city7) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 16 of 19
49. (refuel plane2 city2 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 16 of 19
50. (debark person12 plane2 city2)
   deleted: (in person12 plane2)
   added: (at person12 city2)
   goals met: 17 of 19
51. (fly plane2 city2 city3 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 17 of 19
52. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 17 of 19
53. (debark person1 plane2 city3)
   deleted: (in person1 plane2)
   added: (at person1 city3)
   goals met: 18 of 19
54. (fly plane2 city3 city1 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 19 of 19
